{"titleEn":"Man Of The Year","slug":"tor-saksit-poo-chai-haeng-bpee","titleTh":"ผู้ชายแห่งปี","titleRo":"Poo Chai Haeng Bpee","duration":"288","url":"jnioJ2oeXv4","releaseYear":2018,"type":"Single","artists":[{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"exl0x88tcld8"}},"id":"5y5Yr25fMhpT3QEt38tdw3","type":"Entry","createdAt":"2020-06-08T06:15:25.731Z","updatedAt":"2020-07-02T13:29:35.484Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":5,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"artists"}},"locale":"en-US"},"fields":{"name":"ToR+ Saksit","slug":"tor-saksit","avatar":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"exl0x88tcld8"}},"id":"4sePtqUGW45oeyYtyWfShq","type":"Asset","createdAt":"2020-06-08T06:07:06.345Z","updatedAt":"2020-06-08T06:07:06.345Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"locale":"en-US"},"fields":{"title":"tor-saksit-avatar","file":{"url":"//images.ctfassets.net/exl0x88tcld8/4sePtqUGW45oeyYtyWfShq/580615e88df9b00b0e3cd65e3d5ed956/43715626_10156798540148894_286605422519910400_o.jpg","details":{"size":142532,"image":{"width":827,"height":827}},"fileName":"43715626_10156798540148894_286605422519910400_o.jpg","contentType":"image/jpeg"}}},"coverImage":{"metadata":{"tags":[]},"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"exl0x88tcld8"}},"id":"4hGAdJplG2Ze9bZD0raQWL","type":"Asset","createdAt":"2020-06-08T06:13:07.630Z","updatedAt":"2020-06-08T06:13:07.630Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"locale":"en-US"},"fields":{"title":"tor-saksit-cover","file":{"url":"//images.ctfassets.net/exl0x88tcld8/4hGAdJplG2Ze9bZD0raQWL/5662166e656c8bc1cdc7c268ba732109/87500882_10158158919743894_3032709027982213120_o.jpg","details":{"size":67221,"image":{"width":768,"height":256}},"fileName":"87500882_10158158919743894_3032709027982213120_o.jpg","contentType":"image/jpeg"}}},"coverColor":"#7a90a8","instagram":"/torsaksit","facebook":"/torsaksit","isFeatured":false,"biography":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"โต๋ Saksit Vejsupaporn, or ToR+, was influenced by music from a very early age. His father, Nakorn Vejsupaporn, was a prominent figure from the renowned ‘80s Thai pop band Grand Ex, so ToR+ Saksit was no stranger to the Thai music industry.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"          ToR+ started playing piano at the age of three and through the years, his expertise at the keys caught the attention of world-renowned pianist Richard Clayderman, who invited ToR+ to join him on stage when Clayderman played a concert in Bangkok. His star started to shine from that point on, making an impression with various Thai producers, including Boyd Kosiyabong, producer-songwriter and founder of the indie music record label Bakery Music.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"          Boyd asked ToR+ to join his music project called B5 along with four other promising young artists. Under B5, ToR+ released his debut album Event. Over the years, B5 became very popular, releasing numerous albums until ToR+ was ready to branch out as a solo artist.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"          “During my break, Mr. Neil Thompson, Deputy Managing Director of BEC-TERO, kept checking on my wellness constantly. I told him I was stressed and didn't think I wanted to go back and work the same way I did before. I needed to change. I needed someone who could be with me, walk with me and work with me. Mr. Neil understood my struggles and advised me to see Po.”","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"          His official solo debut album called ToR+ Living in C Major was released in 2007 and was an immediate hit. Leading the success of the album was the smash hit single “Rak Thur”.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"},"birthday":"1984-01-20","isBand":false}}],"genre":"pop","lyricsTh":"มีชายคนนึงเท่าที่เห็นก็ไม่หล่อ\nMee chai kon neung tao tee hen gor mai lor\nAs far as I can see, this man isn’t handsome\nแค่มองนานๆยิ่งไม่ซ้ำ\nKae maung nahn nahn ying mai sum\nThe longer I look, the more I’m turned off\nซิกแพ๊คไม่มี ต่อมความหวานค่อนข้างต่ำ\nSix pack mai mee dtaum kwahm wahn kaun kahng dtum\nHe doesn’t have a six pack, his sweetness gland is producing on the low side\nแต่คะแนนเค้านำเรื่องความจริงใจ\nDtae kanaen kao num reuang kwahm jing jai\nBut he’s leading the score in sincerity\n\nเค้ามองว่าคุณน่ารู้จัก\nKao maung wah koon nah roo juk\nThey all think you’re attractive\nช่างน่ารัก ช่างสดใส\nChahng naruk chahng sot sai\nSo cute, so fresh\nถึงไม่เป๊ะเท่าพระเอกคนไหน\nTeung mai bpeh tao pra ek kon nai\nEven though I’m not as perfect as a leading actor\nต้องวัดกัน ที่หัวใจ\nDtaung wut gun tee hua jai\nI have to test myself with my heart\n\n(*) ผู้ชาย ผู้ชายแห่งปีของคุณ\nPoo chai poo chai haeng bpee kaung koon\nYour man, your man of the year\nหนึ่งคนเกิดมาเพื่อคุณ ต้องคนๆนี้\nNeung kon gert mah peua koon dtaung kon kon nee\nThe person who was born for you must be this man\nผู้ชาย ยิ้มเมื่อเจอะคุณทุกที\nPoo chai yim meua jur koon took tee\nThe man who smiles every time he sees you\nนั่นก็คือตัวผมนี้ พร้อมที่จะรักคุณ\nNun gor keu dtua pom nee praum tee ja ruk koon\nIt’s me, I’m ready to love you\nแต่คุณจะรักเหมือนผมบ้างได้ไหม อยากลุ้น\nDtae koon ja ruk meuan pom bahng dai mai yahk loon\nBut will you love me like I love you? I want to take the chance\n\nมีชายเป็นพันมอบดอกไม้ช่อใหญ่\nMee chai bpen pun maup dauk mai chor yai\nThousands of guys give you big bouquets of flowers\nแต่ทำคุณหัวเราะได้บางไหม\nDtae tum koon hua ror dai bahng mai\nBut can they make you laugh?\nจะมีกี่คนตั้งใจฟังอยู่ใกล้ๆ\nJa mee gee kon dtung jai fung yoo glai glai\nHow many guys are willing to listen to you closely\nในเวลาที่คุณอยากระบาย\nNai welah tee koon yahk rabai\nWhen you want to let off some steam?\n\nผมมองว่าคุณน่ารู้จัก\nPom maung wah koon nah roo juk\nI think you’re attractive\nช่างน่ารัก ช่างสดใส\nchahng naruk chahng sot sai\nSo cute, so fresh\nถึงไม่เป๊ะเท่าพระเอกคนไหน\nTeung mai bpeh tao pra ek kon nai\nEven though I’m not as perfect as a leading actor\nต้องวัดกัน ที่หัวใจ\nDtaung wut gun tee hua jai\nI have to test myself with my heart\n\n(*)\n\nหัวเป็นปีมะเส็งนิสัยอาจชีกอ อ้วนฉุเหมือนปีกุน แถมปากยังปีจอ\nHua bpen bpee ma seng nisai aht chee gor uan choo meuan bpee goon taem bpahk yung bpee jor\nIn my head, it’s year of the snake (+), I might have a playboy personality, I’m overweight like year of the pig, and my mouth is like the year of the dog (+2)\nสมองเท่าปีฉลูไม่ดีพอคุณเลยรีรอ กรี้ดแต่หมากปริญ กรี้ดณเดชน์ กรี้ดลีซอ\nSamaung tao bpee chaloo mai dee por koon loey ree ror greet dtae mahk bprin greet nadech greet leesor\nMy brains are year of the ox, I’m not good enough for you to hesitate on, scream over Mark Prin, scream over Nadech, scream over Leesaw\nเพราะอย่างงี้อ่ะน้อเลยปีชวดเป็นประจำ นักษัตรไก่เป็นปีระกาแต่จีบปีไหนผมก็ระกำ\nPror yahng nee a nor loey bpee chuat bpen bprajum nuk sut gai bpen b pee ragah dtae jeep bpee nai pom gor ragum\nBecause of this, I’m usually year of the rat, the chicken constellation is year of the cock, but any year I flirt, I get grief\nแห้วชั่วนาตาปี หัวปี ท้ายปี ค่อนปี ค้างปี ข้ามปี ชีช้ำกะหล่ำปลี\nWae chua nah dtah bpee hua bpee tai bpee kaun bpee kahng bpee kahm bpee chee chum ga lum bplee\nI’m disappointed year round, at the beginning of the year, at the end of the year, the middle of the year, what’s left of the year, the past year, I’ve been down in the dumps\n\nแต่หยุดรักคุณมันยากยิ่งกว่าหยุดรินเบียร์ เพราะคุณมีค่ากว่ารูปีในธนาคารอินเดีย\nDtae yoot ruk koon mun yahk ying gwah yoot rin bia pror koon mee kah gwah roo bpee nai tanahkahn india\nBut to stop loving you is harder than stopping pouring beer, because you’re more valuable than all the rupees in India\nผู้ชายแห่งปีของทุกคนเป็นพรีเซนเตอร์คลีนแอนด์เคลียร์ แต่ผมคือผู้ชายที่จะเช็ดตัวให้ยามคุณเพลีย\nPoo chai haeng bpee kaung took kon bpen presenter clean and clear dtae pom keu poo chai te eja chet dtua hai yahm koon plia\nEveryone’s man of the year is the Clean and Clear presenter, but I’m the man who will dry you off when you’re tired\nMan of the year ผมคือผู้ชายแห่งปี ผู้ชายที่พร้อมเป็นพ่อของลูกหัวปีท้ายปี\nMan of the year pom keu poo chai haeng bpee poo chai tee praum bpen por kaung look hua bpee tai bpee\nMan of the year, I’m the man of the year, the man who’s ready to be the father of your eldest child to your youngest\nผู้ชายที่แม้คุณเป็นยายแก่ในอีกหลายสิบปี ก็ยังจะมองคุณเป็นนางงามของคุณสุรางค์ เปรมปรีดิ์\nPoo chai tee mae koon bpen yai gae nai eek lai sip bpee gor yung ja maung koon bpen nahng ngahm kaung koon soorahng bprem bpree\nI’m the man who, even though you’ll be a grandma in a few decades, will still look at you as if you were Surang Prempree’s Miss Universe winner\n\n(*)\n\nอยากให้คุณรักผมนะพูดจากใจ ขี้เกียจลุ้น\nYahk hai koon ruk pom na poot jahk jai kee giat loon\nI want you to love me, I’m speaking from the heart, I’m too lazy to compete","credits":"เนื้อร้อง : ประภพ ชมถาวร\nทำนอง : ศักดิ์สิทธิ์ เวชสุภาพร\nเรียบเรียง : ศักดิ์สิทธิ์ เวชสุภาพร / โกมล บุญเพียรผล","deungdutjaisNote":"(+) – To be a “snake head” is slang for being a pervert or having perverted thoughts, so keeping with the “year” theme, he made it “year of the snake”\n(+2) – Similarly, to have a “dog mouth” means you don’t say very nice things","likeCount":4842,"viewCount":408977,"dislikeCount":69,"publishDate":"2018-01-22T12:46:05Z","similars":[{"url":"z1BTc3Ou76Y","slug":"tor-saksit-ket-hahm-huang","titleEn":"An Area Out of My Jurisdiction","titleRo":"Ket Hahm Huang","titleTh":"เขตห้ามหวง","duration":"273","likeCount":79301,"viewCount":7802692,"artistsIds":["5y5Yr25fMhpT3QEt38tdw3"],"publishDate":"2019-05-23T11:00:06Z","dislikeCount":1201},{"url":"j7xN5zvTSag","slug":"tor-saksit-welah-kaung-rao","titleEn":"Our Time","titleRo":"Welah Kaung Rao","titleTh":"เวลาของเรา","duration":"282","likeCount":12358,"viewCount":1860839,"artistsIds":["5y5Yr25fMhpT3QEt38tdw3"],"publishDate":"2017-07-12T13:00:49Z","dislikeCount":245},{"url":"04XThRH0QG4","slug":"tor-saksit-gep-ruk-keun-mah","titleEn":"Taking My Love Back","titleRo":"Gep Ruk Keun Mah","titleTh":"เก็บรักคืนมา","duration":"218","likeCount":3532,"viewCount":415218,"artistsIds":["5y5Yr25fMhpT3QEt38tdw3"],"publishDate":"2018-01-16T13:00:58Z","dislikeCount":65},{"url":"9-UoM2BpY3k","slug":"tor-saksit-suk-wun-kong-dai-jur","titleEn":"Some Day We’ll Meet","titleRo":"Suk Wun Kong Dai Jur","titleTh":"สักวันคงได้เจอ","duration":"293","likeCount":82217,"viewCount":72458301,"artistsIds":["5y5Yr25fMhpT3QEt38tdw3"],"publishDate":"2016-06-28T11:00:09Z","dislikeCount":3513},{"url":"YM_D0Qx5VOk","slug":"room39-kwahm-jing","titleEn":"Truth","titleRo":"Kwahm Jing","titleTh":"ความจริง","duration":"301","likeCount":258495,"viewCount":133634400,"artistsIds":["4WaN1cYHb7c3l8QxtCacWM"],"publishDate":"2015-09-24T10:00:50Z","dislikeCount":10094},{"url":"vhXeio2ObQM","slug":"tor-saksit-bprahgotgahn","titleEn":"Phenomenon","titleRo":"Bprahgotgahn","titleTh":"ปรากฏการณ์","duration":"331","likeCount":19053,"viewCount":5862429,"artistsIds":["5y5Yr25fMhpT3QEt38tdw3"],"publishDate":"2017-01-16T13:00:57Z","dislikeCount":660}],"lastUpdatedSimilars":"2020-07-01T14:39:36.196Z"}